<?php
/***************************************************************************
 *
 * Copyright (c) 2020 Tencent.com, Inc. All Rights Reserved
 * Tencent open optical platform(Toop)
 **************************************************************************/

/**
 * Author: quanweizhou@tencent.com
 * Date: 2021/7/19
 * Time: 2:23 PM
 * Brief:
 */

$str = "{
	\"ticket_no\": \"202107010056\",
	\"create_time\": \"2021-07-01 02:37:13\",
	\"title\": \"【波分干路侧输入无光】清远清新1104-Q02至清远莲湖0101-A01-FIBER-01-(1)\",
	\"fault_desc\": \"描述：DWDM-U2000告警:源IP:172.16.9.21;告警对象:清远-莲湖-ROADM-RXT;告警时间:2021-07-01,02:34:29.0;告警原因:合路信号丢失;告警等级:紧急;告警ID:11244 30745;网元名称:清远-莲湖-ROADM-RXT;子网元名称:QY-LH-0101-L4239-A01-OSN9800-1;告警名称:13OAU1;告警位置:网元ID=234881168,机架=1,机框=167772322,子机框=1,槽位=15,端口=1,;子架名称:QY-LH-0101-L4239-A01-OSN9800-1;拨打华为400电话报修(400-822-9999),VIP客户ID:66731;部门：网络平台部;报警类型：波分干路侧输入无光;IDC:深圳腾 讯腾讯大厦ODC0611;发生时间:2021-07-01 02:37:13\",
	\"alarm_id\": \"162507823308187682\",
	\"ticket_type_name\": \"波分干路中断\",
	\"final_ticket_type_name\": \"线路故障\",
	\"exigence_level\": \"3\",
	\"writer\": \"TMP\",
	\"current_step\": \"结单\",
	\"id\": \"2715986\",
	\"last_ref_ticket_no\": \"None\"
}";
$str = str_replace("：", ":",$str);
$arr = json_decode($str,true);
$goal_str = $arr['fault_desc'];
$format = explode(";",$goal_str);
$str_11 = $format[15];
$ret = explode(":",$str_11);

foreach ($ret as $key => $value) {
    $result[] = $value;
}
//var_dump($format[15]);die();
var_dump($ret);die();


$str = "{
    \"status\": {
        \"code\": 0,
        \"msg\": null
    },
    \"data\": {
        \"category\": [
            {
                \"cid\": 75438,
                \"name\": \"教育频道\",
                \"level\": \"1\",
                \"class_num\": 6,
                \"sub_c\": [
                    {
                        \"cid\": 65694,
                        \"name\": \"高等教育\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"65696\",
                                \"name\": \"工学\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 75447,
                        \"name\": \"高中教育\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75448\",
                                \"name\": \"语文\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75449\",
                                \"name\": \"数学\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65730\",
                                \"name\": \"英语\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75486\",
                                \"name\": \"政史地\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75494\",
                                \"name\": \"理化生\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65773\",
                                \"name\": \"高考\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65813\",
                                \"name\": \"素质教育\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 75558,
                        \"name\": \"初中教育\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75559\",
                                \"name\": \"语文\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75561\",
                                \"name\": \"数学\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65822\",
                                \"name\": \"英语\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65825\",
                                \"name\": \"史地政\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65832\",
                                \"name\": \"理化生\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75582\",
                                \"name\": \"中考\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65874\",
                                \"name\": \"素质教育\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 65878,
                        \"name\": \"小学教育\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"65879\",
                                \"name\": \"语文\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75622\",
                                \"name\": \"数学\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75631\",
                                \"name\": \"英语\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75636\",
                                \"name\": \"小升初\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65904\",
                                \"name\": \"素质教育\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 65910,
                        \"name\": \"育儿亲子\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"65911\",
                                \"name\": \"育儿知识\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65917\",
                                \"name\": \"幼儿早教\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65924\",
                                \"name\": \"成长陪伴\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 65943,
                        \"name\": \"外语学习\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75667\",
                                \"name\": \"英语\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75694\",
                                \"name\": \"日语\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65976\",
                                \"name\": \"韩语\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75703\",
                                \"name\": \"法语\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65980\",
                                \"name\": \"其他语言\",
                                \"level\": \"3\"
                            }
                        ]
                    }
                ]
            },
            {
                \"cid\": 75715,
                \"name\": \"专业知识\",
                \"level\": \"1\",
                \"class_num\": 6,
                \"sub_c\": [
                    {
                        \"cid\": 75716,
                        \"name\": \"IT/互联网\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75717\",
                                \"name\": \"编程语言\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"65998\",
                                \"name\": \"设计制作\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66038\",
                                \"name\": \"数据库\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66046\",
                                \"name\": \"系统架构\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66050\",
                                \"name\": \"系统运维\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66059\",
                                \"name\": \"移动互联网\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75806\",
                                \"name\": \"产品运营\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75815\",
                                \"name\": \"网络安全\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66076\",
                                \"name\": \"嵌入式培训\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66079\",
                                \"name\": \"其他\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 75818,
                        \"name\": \"人文社科\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"66080\",
                                \"name\": \"哲学/历史\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66082\",
                                \"name\": \"文学研究\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75824\",
                                \"name\": \"教育学/心理学\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66090\",
                                \"name\": \"设计/艺术\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75829\",
                                \"name\": \"社会学\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 75831,
                        \"name\": \"经管营销\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75832\",
                                \"name\": \"金融投资\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66110\",
                                \"name\": \"管理类\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66115\",
                                \"name\": \"网络营销\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75851\",
                                \"name\": \"市场销售\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 75856,
                        \"name\": \"自然科学\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75858\",
                                \"name\": \"天文/地理\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66136\",
                                \"name\": \"其他\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66139,
                        \"name\": \"工程科技\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75867\",
                                \"name\": \"电子/电路\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66199,
                        \"name\": \"医药卫生\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"66201\",
                                \"name\": \"中医中药\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66206\",
                                \"name\": \"临床医学\",
                                \"level\": \"3\"
                            }
                        ]
                    }
                ]
            },
            {
                \"cid\": 75938,
                \"name\": \"资格考试\",
                \"level\": \"1\",
                \"class_num\": 10,
                \"sub_c\": [
                    {
                        \"cid\": 66220,
                        \"name\": \"财会类\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75939\",
                                \"name\": \"会计资格\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66221\",
                                \"name\": \"会计职称\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75942\",
                                \"name\": \"注册会计师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75943\",
                                \"name\": \"注册税务师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75945\",
                                \"name\": \"ACCA\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75946\",
                                \"name\": \"CMA\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66226\",
                                \"name\": \"会计证\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66228\",
                                \"name\": \"财会考试\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66230\",
                                \"name\": \"银行从业资格\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66231\",
                                \"name\": \"注册金融分析师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75950\",
                                \"name\": \"证券从业资格\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66232\",
                                \"name\": \"经济师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75955\",
                                \"name\": \"其他\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66235,
                        \"name\": \"建筑类\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75958\",
                                \"name\": \"一级建造师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66237\",
                                \"name\": \"二级建造师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66238\",
                                \"name\": \"建筑师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75959\",
                                \"name\": \"造价师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66239\",
                                \"name\": \"安全工程师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66240\",
                                \"name\": \"监理工程师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66244\",
                                \"name\": \"房产估价\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66245,
                        \"name\": \"医药类\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75964\",
                                \"name\": \"执业医师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"75968\",
                                \"name\": \"执业药师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66249\",
                                \"name\": \"卫生资格\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66250\",
                                \"name\": \"护士资格\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 75970,
                        \"name\": \"资格类\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"66255\",
                                \"name\": \"企业管理\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66259\",
                                \"name\": \"师资培训\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66263\",
                                \"name\": \"司法考试\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66268\",
                                \"name\": \"其它\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 75978,
                        \"name\": \"计算机类\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"75979\",
                                \"name\": \"资格认证\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66279\",
                                \"name\": \"软件水平考试\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66306\",
                                \"name\": \"计算机等级考试\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 76023,
                        \"name\": \"公务员类\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"76024\",
                                \"name\": \"国考\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66320\",
                                \"name\": \"省考/地方考试\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76030\",
                                \"name\": \"其他\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66328,
                        \"name\": \"学历类\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"66329\",
                                \"name\": \"学历考试\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66331\",
                                \"name\": \"考研\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 76051,
                        \"name\": \"外语类\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"66340\",
                                \"name\": \"英语四级\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76052\",
                                \"name\": \"英语六级\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66347\",
                                \"name\": \"留学指导\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66354\",
                                \"name\": \"留学考试\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66363,
                        \"name\": \"音乐类\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"76073\",
                                \"name\": \"音乐考级\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76074\",
                                \"name\": \"社会音乐教育\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66367,
                        \"name\": \"其他\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"66368\",
                                \"name\": \"导游证\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66370\",
                                \"name\": \"心理咨询师\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76076\",
                                \"name\": \"专利代理人\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76077\",
                                \"name\": \"其他\",
                                \"level\": \"3\"
                            }
                        ]
                    }
                ]
            },
            {
                \"cid\": 76078,
                \"name\": \"职业发展\",
                \"level\": \"1\",
                \"class_num\": 6,
                \"sub_c\": [
                    {
                        \"cid\": 66371,
                        \"name\": \"求职\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"66372\",
                                \"name\": \"大学生就业指导\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66373\",
                                \"name\": \"职业规划\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76080\",
                                \"name\": \"求职简历\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76081\",
                                \"name\": \"面试技巧\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76082\",
                                \"name\": \"网申技巧\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76083\",
                                \"name\": \"跳槽\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66374\",
                                \"name\": \"求职\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66375,
                        \"name\": \"职场技能\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"76084\",
                                \"name\": \"个人特质\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76089\",
                                \"name\": \"基础技能\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76093\",
                                \"name\": \"工作技能\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76095\",
                                \"name\": \"团队技能\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76099\",
                                \"name\": \"职场技能\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 76100,
                        \"name\": \"企业管理\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"66382\",
                                \"name\": \"其他\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76101\",
                                \"name\": \"人力资源管理\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66386\",
                                \"name\": \"财务/会计\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76102\",
                                \"name\": \"销售管理\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66387\",
                                \"name\": \"战略管理\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76103\",
                                \"name\": \"企业培训\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76104\",
                                \"name\": \"企业管理\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66388,
                        \"name\": \"办公软件\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"76105\",
                                \"name\": \"Office\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66391\",
                                \"name\": \"WPS\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 76115,
                        \"name\": \"电脑基础\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"76116\",
                                \"name\": \"Windows\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66397\",
                                \"name\": \"电脑培训\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66398\",
                                \"name\": \"软件技术\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66400,
                        \"name\": \"其他技能\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"76119\",
                                \"name\": \"领导力培训\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76124\",
                                \"name\": \"创业\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66406\",
                                \"name\": \"职场礼仪\",
                                \"level\": \"3\"
                            }
                        ]
                    }
                ]
            },
            {
                \"cid\": 66409,
                \"name\": \"生活休闲\",
                \"level\": \"1\",
                \"class_num\": 3,
                \"sub_c\": [
                    {
                        \"cid\": 66410,
                        \"name\": \"生活娱乐\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"76133\",
                                \"name\": \"饮食\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66414\",
                                \"name\": \"美容化妆\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66425\",
                                \"name\": \"社交礼仪\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76148\",
                                \"name\": \"养生保健\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 76149,
                        \"name\": \"兴趣爱好\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"76150\",
                                \"name\": \"美术\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76151\",
                                \"name\": \"音乐\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66430\",
                                \"name\": \"数码/摄影\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76166\",
                                \"name\": \"体育/运动\",
                                \"level\": \"3\"
                            }
                        ]
                    },
                    {
                        \"cid\": 66451,
                        \"name\": \"其他\",
                        \"level\": \"2\",
                        \"sub_c\": [
                            {
                                \"cid\": \"66452\",
                                \"name\": \"宠物\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"76176\",
                                \"name\": \"生存逃生\",
                                \"level\": \"3\"
                            },
                            {
                                \"cid\": \"66455\",
                                \"name\": \"其他\",
                                \"level\": \"3\"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}";

$arr = json_decode($str,true);
var_dump($arr);